analogdevicesinc/msdk/Examples/MAX32665/AUDIO_Playback/audio_regs.h
/**
 * @file    audio_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the AUDIO Peripheral Module.
 */

/******************************************************************************
 * Copyright (C) 2023 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

#ifndef LIBRARIES_PERIPHDRIVERS_SOURCE_AUDIO_REGS_H_
#define LIBRARIES_PERIPHDRIVERS_SOURCE_AUDIO_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__ICCARM__)
#pragma system_include
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile /*!< Defines 'read / write' permissions */
#endif
#ifndef __I
#define __I volatile const /*!< Defines 'read only' permissions */
#endif
#ifndef __O
#define __O volatile /*!< Defines 'write only' permissions */
#endif
#ifndef __R
#define __R volatile const /*!< Defines 'read only' permissions */
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     audio
 * @defgroup    audio_registers PCM_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the AUDIO Subsystem Peripheral Module.
 * @details     Audio Subsystem.
 */

/**
 * @ingroup audio_registers
 * Structure type to access the AUDIO Registers.
 */

typedef struct {
    __IO uint32_t tx_pdm_ch0_addr; /**< <tt>\b 0x00:</tt> PDM Tx FIFO Data Channel 0 Register */
    __IO uint32_t tx_pdm_ch1_addr; /**< <tt>\b 0x04:</tt> PDM Tx FIFO Data Channel 1 Register */
    __I uint32_t rx_pdm_1_ch0_addr; /**< <tt>\b 0x08:</tt> PDM Rx1 FIFO Data Channel 0 Register */
    __I uint32_t rx_pdm_1_ch1_addr; /**< <tt>\b 0x0C:</tt> PDM Rx1 FIFO Data Channel 1 Register */
    __I uint32_t rx_pdm_2_ch0_addr; /**< <tt>\b 0x10:</tt> PDM Rx2 FIFO Data Channel 0 Register */
    __I uint32_t rx_pdm_2_ch1_addr; /**< <tt>\b 0x14:</tt> PDM Rx2 FIFO Data Channel 1 Register */
    __I uint32_t rx_pdm_3_ch0_addr; /**< <tt>\b 0x18:</tt> PDM Rx3 FIFO Data Channel 0 Register */
    __I uint32_t rx_pdm_3_ch1_addr; /**< <tt>\b 0x1C:</tt> PDM Rx3 FIFO Data Channel 1 Register */

    __IO uint32_t tx_pcm_ch0_addr; /**< <tt>\b 0x20:</tt> PCM Tx FIFO Data Channel 0 Register */
    __IO uint32_t tx_pcm_ch1_addr; /**< <tt>\b 0x24:</tt> PCM Tx FIFO Data Channel 1 Register */
    __IO uint32_t tx_pcm_ch2_addr; /**< <tt>\b 0x28:</tt> PCM Tx FIFO Data Channel 2 Register */
    __IO uint32_t tx_pcm_ch3_addr; /**< <tt>\b 0x2C:</tt> PCM Tx FIFO Data Channel 3 Register */
    __I uint32_t rx_pcm_ch0_addr; /**< <tt>\b 0x30:</tt> PCM Rx FIFO Data Channel 0 Register */
    __I uint32_t rx_pcm_ch1_addr; /**< <tt>\b 0x34:</tt> PCM Rx FIFO Data Channel 1 Register */
    __I uint32_t rx_pcm_ch2_addr; /**< <tt>\b 0x38:</tt> PCM Rx FIFO Data Channel 2 Register */
    __I uint32_t rx_pcm_ch3_addr; /**< <tt>\b 0x3C:</tt> PCM Rx FIFO Data Channel 3 Register */
    __I uint32_t rx_pcm_ch4_addr; /**< <tt>\b 0x40:</tt> PCM Rx FIFO Data Channel 4 Register */
    __I uint32_t rx_pcm_ch5_addr; /**< <tt>\b 0x44:</tt> PCM Rx FIFO Data Channel 5 Register */
    __I uint32_t rx_pcm_ch6_addr; /**< <tt>\b 0x48:</tt> PCM Rx FIFO Data Channel 6 Register */
    __I uint32_t rx_pcm_ch7_addr; /**< <tt>\b 0x4C:</tt> PCM Rx FIFO Data Channel 7 Register */

    __I uint32_t int_pdm_status; /**< <tt>\b 0x50:</tt> PDM FIFO Status Register */
    __IO uint32_t int_pdm_clr; /**< <tt>\b 0x54:</tt> PDM Interrupt Clear Register */

    __I uint32_t int_pcm_tx_status; /**< <tt>\b 0x58:</tt> PCM Tx FIFO Status Register */
    __IO uint32_t int_pcm_tx_clr; /**< <tt>\b 0x5C:</tt> PCM Tx Interrupt Clear Register */
    __I uint32_t int_pcm_rx_status; /**< <tt>\b 0x60:</tt> PCM Rx FIFO Status Register */
    __IO uint32_t int_pcm_rx_clr; /**< <tt>\b 0x64:</tt> PCM Rx Interrupt Clear Register */
    __IO uint32_t int_en; /**< <tt>\b 0x68:</tt> Interrupt Enable Register */

    __I uint8_t rsv_0x6C_0x7F[0x14];

    __IO uint32_t m_val; /**< <tt>\b 0x80:</tt> NM Generator Denominator M Register */
    __I uint32_t rsv_0x840_0x87[0x01];
    __IO uint32_t n_val; /**< <tt>\b 0x88:</tt> NM Generator Denominator N Register */

    __I uint8_t rsv_0x8C_0x93[0x08];

    __IO uint32_t pdm_tx_rate_setup; /**< <tt>\b 0x94:</tt> PDM Tx Rate Setup Register */

    __IO uint32_t modulator_controls; /**< <tt>\b 0x98:</tt> Modulator Configuration Register */

    __IO uint32_t pdm_tx_control_1; /**< <tt>\b 0x9C:</tt> PDM Tx Configuration 0 Register */
    __IO uint32_t pdm_rx_rate_setup; /**< <tt>\b 0xA0:</tt> PDM Rx Clock Configuration Register */
    __IO uint32_t pdm_tx_control_2; /**< <tt>\b 0xA4:</tt> PDM Tx Configuration 1 Register */
    __IO uint32_t pdm_rx_1_control; /**< <tt>\b 0xA8:</tt> PDM Rx1 Configuration Register */
    __IO uint32_t pdm_rx_2_control; /**< <tt>\b 0xAC:</tt> PDM Rx2 Configuration Register */
    __IO uint32_t pdm_rx_3_control; /**< <tt>\b 0xB0:</tt> PDM Rx3 Configuration Register */

    __IO uint32_t pcm_clock_dividers_msb; /**< <tt>\b 0xB4:</tt> PCM BCLK Configuration 0 Register */
    __IO uint32_t pcm_clock_dividers_lsb; /**< <tt>\b 0xB8:</tt> PCM BCLK Configuration 1 Register */
    __IO uint32_t pcm_clock_setup; /**< <tt>\b 0xBC:</tt> PCM Clock Configuration Register */
    __IO uint32_t pcm_config; /**< <tt>\b 0xC0:</tt> PCM Configuration Register */

    __IO uint32_t
        pcm_tx_sample_rates; /**< <tt>\b 0xC4:</tt> PCM Tx Sample Rate Configuration Register */
    __IO uint32_t
        pcm_rx_sample_rates; /**< <tt>\b 0xC8:</tt> PCM Rx Sample Rate Configuration Register */

    __IO uint32_t pcm_rx_enables_byte0; /**< <tt>\b 0xCC:</tt> PCM Rx Channel Enable 0 Register */
    __IO uint32_t pcm_rx_enables_byte1; /**< <tt>\b 0xD0:</tt> PCM Rx Channel Enable 1 Register */

    __IO uint32_t pcm_tx_enables_byte0; /**< <tt>\b 0xD4:</tt> PCM Tx Channel Enable 0 Register */
    __IO uint32_t pcm_tx_enables_byte1; /**< <tt>\b 0xD8:</tt> PCM Tx Channel Enable 1 Register */

