analogdevicesinc/msdk/Examples/MAX32665/AUDIO_Playback/audio_regs.h
    __IO uint32_t pcm_tx_hiz_byte0; /**< <tt>\b 0xDC:</tt> PCM Tx Channel HI-Z Enable 0 Register */
    __IO uint32_t pcm_tx_hiz_byte1; /**< <tt>\b 0xE0:</tt> PCM Tx Channel HI-Z Enable 1 Register */

    __IO uint32_t
        dataport1_slot_mapping_ch0; /**< <tt>\b 0xE4:</tt>  Dataport 1 Slot Mapping Channel 0 Register */
    __IO uint32_t
        dataport1_slot_mapping_ch1; /**< <tt>\b 0xE8:</tt>  Dataport 1 Slot Mapping Channel 1 Register */
    __IO uint32_t
        dataport1_slot_mapping_ch2; /**< <tt>\b 0xEC:</tt>  Dataport 1 Slot Mapping Channel 2 Register */
    __IO uint32_t
        dataport1_slot_mapping_ch3; /**< <tt>\b 0xF0:</tt>  Dataport 1 Slot Mapping Channel 3 Register */
    __IO uint32_t
        dataport2_slot_mapping_ch0; /**< <tt>\b 0xF4:</tt>  Dataport 2 Slot Mapping Channel 0 Register */
    __IO uint32_t
        dataport2_slot_mapping_ch1; /**< <tt>\b 0xF8:</tt>  Dataport 2 Slot Mapping Channel 1 Register */
    __IO uint32_t
        dataport2_slot_mapping_ch2; /**< <tt>\b 0xFC:</tt>  Dataport 2 Slot Mapping Channel 2 Register */
    __IO uint32_t
        dataport2_slot_mapping_ch3; /**< <tt>\b 0x100:</tt> Dataport 2 Slot Mapping Channel 3 Register */
    __IO uint32_t
        dataport2_slot_mapping_ch4; /**< <tt>\b 0x104:</tt> Dataport 2 Slot Mapping Channel 4 Register */
    __IO uint32_t
        dataport2_slot_mapping_ch5; /**< <tt>\b 0x108:</tt> Dataport 2 Slot Mapping Channel 5 Register */
    __IO uint32_t
        dataport2_slot_mapping_ch6; /**< <tt>\b 0x10C:</tt> Dataport 2 Slot Mapping Channel 6 Register */
    __IO uint32_t
        dataport2_slot_mapping_ch7; /**< <tt>\b 0x110:</tt> Dataport 2 Slot Mapping Channel 7 Register */

    __IO uint32_t pcm_data_controls; /**< <tt>\b 0x114:</tt> PCM Data Controls Register */
    __IO uint32_t global_en; /**< <tt>\b 0x118:</tt> Audio Enable Register */
} mxc_audio_regs_t;

/* Register offsets for module AUDIO */
/**
 * @ingroup    audio_registers
 * @defgroup   AUDIO_Register_Offsets Register Offsets
 * @brief      AUDIO Peripheral Register Offsets from the I2S_REVA Base Peripheral Address. 
 * @{
 */

#define MXC_R_AUDIO_TX_PDM_CH0_ADDR \
    ((uint32_t)0x00000000UL) /**< Offset from AUDIO Base Address: <tt> 0x0000</tt> */
#define MXC_R_AUDIO_TX_PDM_CH1_ADDR \
    ((uint32_t)0x00000004UL) /**< Offset from AUDIO Base Address: <tt> 0x0004</tt> */
#define MXC_R_AUDIO_RX_PDM_1_CH0_ADDR \
    ((uint32_t)0x00000008UL) /**< Offset from AUDIO Base Address: <tt> 0x0008</tt> */
#define MXC_R_AUDIO_RX_PDM_1_CH1_ADDR \
    ((uint32_t)0x0000000CUL) /**< Offset from AUDIO Base Address: <tt> 0x000C</tt> */
#define MXC_R_AUDIO_RX_PDM_2_CH0_ADDR \
    ((uint32_t)0x00000010UL) /**< Offset from AUDIO Base Address: <tt> 0x0010</tt> */
#define MXC_R_AUDIO_RX_PDM_2_CH1_ADDR \
    ((uint32_t)0x00000014UL) /**< Offset from AUDIO Base Address: <tt> 0x0014</tt> */
#define MXC_R_AUDIO_RX_PDM_3_CH0_ADDR \
    ((uint32_t)0x00000018UL) /**< Offset from AUDIO Base Address: <tt> 0x0018</tt> */
#define MXC_R_AUDIO_RX_PDM_3_CH1_ADDR \
    ((uint32_t)0x0000001CUL) /**< Offset from AUDIO Base Address: <tt> 0x001C</tt> */
#define MXC_R_AUDIO_TX_PCM_CH0_ADDR \
    ((uint32_t)0x00000020UL) /**< Offset from AUDIO Base Address: <tt> 0x0020</tt> */
#define MXC_R_AUDIO_TX_PCM_CH1_ADDR \
    ((uint32_t)0x00000024UL) /**< Offset from AUDIO Base Address: <tt> 0x0024</tt> */
#define MXC_R_AUDIO_TX_PCM_CH2_ADDR \
    ((uint32_t)0x00000028UL) /**< Offset from AUDIO Base Address: <tt> 0x0028</tt> */
#define MXC_R_AUDIO_TX_PCM_CH3_ADDR \
    ((uint32_t)0x0000002CUL) /**< Offset from AUDIO Base Address: <tt> 0x002C</tt> */
#define MXC_R_AUDIO_RX_PCM_CH0_ADDR \
    ((uint32_t)0x00000030UL) /**< Offset from AUDIO Base Address: <tt> 0x0030</tt> */
#define MXC_R_AUDIO_RX_PCM_CH1_ADDR \
    ((uint32_t)0x00000034UL) /**< Offset from AUDIO Base Address: <tt> 0x0034</tt> */
#define MXC_R_AUDIO_RX_PCM_CH2_ADDR \
    ((uint32_t)0x00000038UL) /**< Offset from AUDIO Base Address: <tt> 0x0038</tt> */
#define MXC_R_AUDIO_RX_PCM_CH3_ADDR \
    ((uint32_t)0x0000003CUL) /**< Offset from AUDIO Base Address: <tt> 0x003C</tt> */
#define MXC_R_AUDIO_RX_PCM_CH4_ADDR \
    ((uint32_t)0x00000040UL) /**< Offset from AUDIO Base Address: <tt> 0x0040</tt> */
#define MXC_R_AUDIO_RX_PCM_CH5_ADDR \
    ((uint32_t)0x00000044UL) /**< Offset from AUDIO Base Address: <tt> 0x0044</tt> */
#define MXC_R_AUDIO_RX_PCM_CH6_ADDR \
    ((uint32_t)0x00000048UL) /**< Offset from AUDIO Base Address: <tt> 0x0048</tt> */
#define MXC_R_AUDIO_RX_PCM_CH7_ADDR \
    ((uint32_t)0x0000004CUL) /**< Offset from AUDIO Base Address: <tt> 0x004C</tt> */
#define MXC_R_AUDIO_INT_PDM_STATUS \
    ((uint32_t)0x00000050UL) /**< Offset from AUDIO Base Address: <tt> 0x0050</tt> */
#define MXC_R_AUDIO_INT_PDM_CLR \
    ((uint32_t)0x00000054UL) /**< Offset from AUDIO Base Address: <tt> 0x0054</tt> */
#define MXC_R_AUDIO_INT_PCM_TX_STATUS \
    ((uint32_t)0x00000058UL) /**< Offset from AUDIO Base Address: <tt> 0x0058</tt> */
#define MXC_R_AUDIO_INT_PCM_TX_CLR \
    ((uint32_t)0x0000005CUL) /**< Offset from AUDIO Base Address: <tt> 0x005C</tt> */
#define MXC_R_AUDIO_INT_PCM_RX_STATUS \
    ((uint32_t)0x00000060UL) /**< Offset from AUDIO Base Address: <tt> 0x0060</tt> */
#define MXC_R_AUDIO_INT_PCM_RX_CLR \
    ((uint32_t)0x00000064UL) /**< Offset from AUDIO Base Address: <tt> 0x0064</tt> */
#define MXC_R_AUDIO_INT_EN \
    ((uint32_t)0x00000068UL) /**< Offset from AUDIO Base Address: <tt> 0x0068</tt> */
#define MXC_R_AUDIO_M_VAL \
    ((uint32_t)0x00000080UL) /**< Offset from AUDIO Base Address: <tt> 0x0080</tt> */
#define MXC_R_AUDIO_RES \
    ((uint32_t)0x00000084UL) /**< Offset from AUDIO Base Address: <tt> 0x0084</tt> */
#define MXC_R_AUDIO_N_VAL \
    ((uint32_t)0x00000088UL) /**< Offset from AUDIO Base Address: <tt> 0x0088</tt> */
#define MXC_R_AUDIO_PDM_TX_RATE_SETUP \
    ((uint32_t)0x00000094UL) /**< Offset from AUDIO Base Address: <tt> 0x0094</tt> */
#define MXC_R_AUDIO_MODULATOR_CONTROLS \
    ((uint32_t)0x00000098UL) /**< Offset from AUDIO Base Address: <tt> 0x0098</tt> */
#define MXC_R_AUDIO_PDM_TX_CONTROL_1 \
    ((uint32_t)0x0000009CUL) /**< Offset from AUDIO Base Address: <tt> 0x009C</tt> */
#define MXC_R_AUDIO_PDM_RX_RATE_SETUP \
    ((uint32_t)0x000000A0UL) /**< Offset from AUDIO Base Address: <tt> 0x00A0</tt> */
#define MXC_R_AUDIO_PDM_TX_CONTROL_2 \
    ((uint32_t)0x000000A4UL) /**< Offset from AUDIO Base Address: <tt> 0x00A4</tt> */
#define MXC_R_AUDIO_PDM_RX_1_CONTROL \
    ((uint32_t)0x000000A8UL) /**< Offset from AUDIO Base Address: <tt> 0x00A8</tt> */
#define MXC_R_AUDIO_PDM_RX_2_CONTROL \
    ((uint32_t)0x000000ACUL) /**< Offset from AUDIO Base Address: <tt> 0x00AC</tt> */
#define MXC_R_AUDIO_PDM_RX_3_CONTROL \
    ((uint32_t)0x000000B0UL) /**< Offset from AUDIO Base Address: <tt> 0x00B0</tt> */
#define MXC_R_AUDIO_PCM_CLOCK_DIVIDERS_MSB \
    ((uint32_t)0x000000B4UL) /**< Offset from AUDIO Base Address: <tt> 0x00B4</tt> */
#define MXC_R_AUDIO_PCM_CLOCK_DIVIDERS_LSB \
    ((uint32_t)0x000000B8UL) /**< Offset from AUDIO Base Address: <tt> 0x00B8</tt> */
#define MXC_R_AUDIO_PCM_CLOCK_SET_UP \
    ((uint32_t)0x000000BCUL) /**< Offset from AUDIO Base Address: <tt> 0x00BC</tt> */
#define MXC_R_AUDIO_PCM_CONFIG \
    ((uint32_t)0x000000C0UL) /**< Offset from AUDIO Base Address: <tt> 0x00C0</tt> */
#define MXC_R_AUDIO_PCM_TX_SAMPLE_RATES \
    ((uint32_t)0x000000C4UL) /**< Offset from AUDIO Base Address: <tt> 0x00C4</tt> */
#define MXC_R_AUDIO_PCM_RX_SAMPLE_RATES \
    ((uint32_t)0x000000C8UL) /**< Offset from AUDIO Base Address: <tt> 0x00C8</tt> */
#define MXC_R_AUDIO_PCM_RX_ENABLES_BYTE0 \
    ((uint32_t)0x000000CCUL) /**< Offset from AUDIO Base Address: <tt> 0x00CC</tt> */
#define MXC_R_AUDIO_PCM_RX_ENABLES_BYTE1 \
    ((uint32_t)0x000000D0UL) /**< Offset from AUDIO Base Address: <tt> 0x00D0</tt> */
#define MXC_R_AUDIO_PCM_TX_ENABLES_BYTE0 \
    ((uint32_t)0x000000D4UL) /**< Offset from AUDIO Base Address: <tt> 0x00D4</tt> */
#define MXC_R_AUDIO_PCM_TX_ENABLES_BYTE1 \
    ((uint32_t)0x000000D8UL) /**< Offset from AUDIO Base Address: <tt> 0x00D8</tt> */
#define MXC_R_AUDIO_PCM_TX_HIZ_BYTE0 \
    ((uint32_t)0x000000DCUL) /**< Offset from AUDIO Base Address: <tt> 0x00DC</tt> */
#define MXC_R_AUDIO_PCM_TX_HIZ_BYTE1 \
    ((uint32_t)0x000000E0UL) /**< Offset from AUDIO Base Address: <tt> 0x00E0</tt> */
#define MXC_R_AUDIO_DATAPORT1_SLOT_MAPPING_CH0 \
    ((uint32_t)0x000000E4UL) /**< Offset from AUDIO Base Address: <tt> 0x00E4</tt> */
#define MXC_R_AUDIO_DATAPORT1_SLOT_MAPPING_CH1 \
    ((uint32_t)0x000000E8UL) /**< Offset from AUDIO Base Address: <tt> 0x00E8</tt> */
#define MXC_R_AUDIO_DATAPORT1_SLOT_MAPPING_CH2 \
    ((uint32_t)0x000000ECUL) /**< Offset from AUDIO Base Address: <tt> 0x00EC</tt> */
#define MXC_R_AUDIO_DATAPORT1_SLOT_MAPPING_CH3 \
    ((uint32_t)0x000000F0UL) /**< Offset from AUDIO Base Address: <tt> 0x00F0</tt> */
#define MXC_R_AUDIO_DATAPORT2_SLOT_MAPPING_CH0 \
    ((uint32_t)0x000000F4UL) /**< Offset from AUDIO Base Address: <tt> 0x00F4</tt> */
#define MXC_R_AUDIO_DATAPORT2_SLOT_MAPPING_CH1 \
    ((uint32_t)0x000000F8UL) /**< Offset from AUDIO Base Address: <tt> 0x00F8</tt> */
#define MXC_R_AUDIO_DATAPORT2_SLOT_MAPPING_CH2 \
    ((uint32_t)0x000000FCUL) /**< Offset from AUDIO Base Address: <tt> 0x00FC</tt> */
#define MXC_R_AUDIO_DATAPORT2_SLOT_MAPPING_CH3 \
    ((uint32_t)0x00000100UL) /**< Offset from AUDIO Base Address: <tt> 0x0100</tt> */
#define MXC_R_AUDIO_DATAPORT2_SLOT_MAPPING_CH4 \
    ((uint32_t)0x00000104UL) /**< Offset from AUDIO Base Address: <tt> 0x0104</tt> */
#define MXC_R_AUDIO_DATAPORT2_SLOT_MAPPING_CH5 \
    ((uint32_t)0x00000108UL) /**< Offset from AUDIO Base Address: <tt> 0x0108</tt> */
#define MXC_R_AUDIO_DATAPORT2_SLOT_MAPPING_CH6 \
    ((uint32_t)0x0000010CUL) /**< Offset from AUDIO Base Address: <tt> 0x010C</tt> */
#define MXC_R_AUDIO_DATAPORT2_SLOT_MAPPING_CH7 \
    ((uint32_t)0x00000110UL) /**< Offset from AUDIO Base Address: <tt> 0x0110</tt> */
#define MXC_R_AUDIO_PCM_DATA_CONTROLS \
    ((uint32_t)0x00000114UL) /**< Offset from AUDIO Base Address: <tt> 0x0114</tt> */
#define MXC_R_AUDIO_GLOBAL_EN \
    ((uint32_t)0x00000118UL) /**< Offset from AUDIO Base Address: <tt> 0x0000</tt> */

/**@} end of group audio_registers */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_INT_PDM_STATUS AUDIO_INT_PDM_STATUS
 * @brief    PDM Interrupt Status.
 * @{
 */
#define MXC_F_PDM_RX3_FIFO_CH1_ALMOST_EMPTY_POS \
    8 /**< MXC_F_PDM_RX3_FIFO_CH1_ALMOST_EMPTY_POS Position */
#define MXC_F_PDM_RX3_FIFO_CH1_ALMOST_EMPTY \
    ((uint32_t)(0x1UL                       \
                << MXC_F_PDM_RX3_FIFO_CH1_ALMOST_EMPTY_POS)) /**< MXC_F_PDM_RX3_FIFO_CH1_ALMOST_EMPTY_POS Mask */

#define MXC_F_PDM_RX3_FIFO_CH0_ALMOST_EMPTY_POS \
    9 /**< MXC_F_PDM_RX3_FIFO_CH0_ALMOST_EMPTY_POS Position */
#define MXC_F_PDM_RX3_FIFO_CH0_ALMOST_EMPTY \
    ((uint32_t)(0x1UL                       \
                << MXC_F_PDM_RX3_FIFO_CH0_ALMOST_EMPTY_POS)) /**< MXC_F_PDM_RX3_FIFO_CH0_ALMOST_EMPTY_POS Mask */

#define MXC_F_PDM_RX2_FIFO_CH1_ALMOST_EMPTY_POS \
    10 /**< MXC_F_PDM_RX2_FIFO_CH1_ALMOST_EMPTY_POS Position */
#define MXC_F_PDM_RX2_FIFO_CH1_ALMOST_EMPTY \
    ((uint32_t)(0x1UL                       \
                << MXC_F_PDM_RX2_FIFO_CH1_ALMOST_EMPTY_POS)) /**< MXC_F_PDM_RX2_FIFO_CH1_ALMOST_EMPTY_POS Mask */

