analogdevicesinc/msdk/Examples/MAX32665/AUDIO_Playback/audio_regs.h
/**@} end of group AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_0 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_1 AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_1
 * @brief    Dataport 1 Slot Mapping Registers Channel 1
 * @{
 */

#define MXC_F_PCM_DPORT1_SLOT_MAP_CH1_POS 0 /**< MXC_F_PCM_DPORT1_SLOT_MAP_CH1 Position */
#define MXC_F_PCM_DPORT1_SLOT_MAP_CH1 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT1_SLOT_MAP_CH1_POS)) /**< MXC_F_PCM_DPORT1_SLOT_MAP_CH1 */

#define MXC_F_PCM_DPORT1_CH1_EN_POS 7 /**< MXC_F_PCM_DPORT1_CH1_EN Position */
#define MXC_F_PCM_DPORT1_CH1_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT1_CH1_EN_POS)) /**< MXC_F_PCM_DPORT1_CH1_EN */

/**@} end of group AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_1 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_2 AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_2
 * @brief    Dataport 1 Slot Mapping Registers Channel 2
 * @{
 */

#define MXC_F_PCM_DPORT1_SLOT_MAP_CH2_POS 0 /**< MXC_F_PCM_DPORT1_SLOT_MAP_CH2 Position */
#define MXC_F_PCM_DPORT1_SLOT_MAP_CH2 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT1_SLOT_MAP_CH2_POS)) /**< MXC_F_PCM_DPORT1_SLOT_MAP_CH2 */

#define MXC_F_PCM_DPORT1_CH2_EN_POS 7 /**< MXC_F_PCM_DPORT1_CH2_EN Position */
#define MXC_F_PCM_DPORT1_CH2_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT1_CH2_EN_POS)) /**< MXC_F_PCM_DPORT1_CH2_EN */

/**@} end of group AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_2 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_3 AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_3
 * @brief    Dataport 1 Slot Mapping Registers Channel 3
 * @{
 */

#define MXC_F_PCM_DPORT1_SLOT_MAP_CH3_POS 0 /**< MXC_F_PCM_DPORT1_SLOT_MAP_CH3 Position */
#define MXC_F_PCM_DPORT1_SLOT_MAP_CH3 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT1_SLOT_MAP_CH3_POS)) /**< MXC_F_PCM_DPORT1_SLOT_MAP_CH3 */

#define MXC_F_PCM_DPORT1_CH3_EN_POS 7 /**< MXC_F_PCM_DPORT1_CH3_EN Position */
#define MXC_F_PCM_DPORT1_CH3_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT1_CH3_EN_POS)) /**< MXC_F_PCM_DPORT1_CH3_EN */

/**@} end of group AUDIO_PCM_DATAPORT_1_SLOT_MAPPING_CHANNEL_3 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_0 AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_0
 * @brief    Dataport 1 Slot Mapping Registers Channel 0
 * @{
 */

#define MXC_F_PCM_DPORT2_SLOT_MAP_CH0_POS 0 /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH0 Position */
#define MXC_F_PCM_DPORT2_SLOT_MAP_CH0 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT2_SLOT_MAP_CH0_POS)) /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH0 */

#define MXC_F_PCM_DPORT2_CH0_EN_POS 7 /**< MXC_F_PCM_DPORT2_CH0_EN Position */
#define MXC_F_PCM_DPORT2_CH0_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT2_CH0_EN_POS)) /**< MXC_F_PCM_DPORT2_CH0_EN */

/**@} end of group AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_0 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_1 AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_1
 * @brief    Dataport 1 Slot Mapping Registers Channel 1
 * @{
 */

#define MXC_F_PCM_DPORT2_SLOT_MAP_CH1_POS 0 /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH1 Position */
#define MXC_F_PCM_DPORT2_SLOT_MAP_CH1 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT2_SLOT_MAP_CH1_POS)) /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH1 */

#define MXC_F_PCM_DPORT2_CH1_EN_POS 7 /**< MXC_F_PCM_DPORT2_CH1_EN Position */
#define MXC_F_PCM_DPORT2_CH1_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT2_CH1_EN_POS)) /**< MXC_F_PCM_DPORT2_CH1_EN */

/**@} end of group AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_1 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_2 AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_2
 * @brief    Dataport 1 Slot Mapping Registers Channel 2
 * @{
 */

#define MXC_F_PCM_DPORT2_SLOT_MAP_CH2_POS 0 /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH2 Position */
#define MXC_F_PCM_DPORT2_SLOT_MAP_CH2 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT2_SLOT_MAP_CH2_POS)) /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH2 */

#define MXC_F_PCM_DPORT2_CH2_EN_POS 7 /**< MXC_F_PCM_DPORT2_CH2_EN Position */
#define MXC_F_PCM_DPORT2_CH2_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT2_CH2_EN_POS)) /**< MXC_F_PCM_DPORT2_CH2_EN */

/**@} end of group AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_2 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_3 AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_3
 * @brief    Dataport 1 Slot Mapping Registers Channel 3
 * @{
 */

#define MXC_F_PCM_DPORT2_SLOT_MAP_CH3_POS 0 /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH3 Position */
#define MXC_F_PCM_DPORT2_SLOT_MAP_CH3 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT2_SLOT_MAP_CH3_POS)) /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH3 */

#define MXC_F_PCM_DPORT2_CH3_EN_POS 7 /**< MXC_F_PCM_DPORT2_CH3_EN Position */
#define MXC_F_PCM_DPORT2_CH3_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT2_CH3_EN_POS)) /**< MXC_F_PCM_DPORT2_CH3_EN */

/**@} end of group AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_3 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_4 AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_4
 * @brief    Dataport 1 Slot Mapping Registers Channel 4
 * @{
 */

#define MXC_F_PCM_DPORT2_SLOT_MAP_CH4_POS 0 /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH4 Position */
#define MXC_F_PCM_DPORT2_SLOT_MAP_CH4 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT2_SLOT_MAP_CH4_POS)) /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH4 */

#define MXC_F_PCM_DPORT2_CH4_EN_POS 7 /**< MXC_F_PCM_DPORT2_CH4_EN Position */
#define MXC_F_PCM_DPORT2_CH4_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT2_CH4_EN_POS)) /**< MXC_F_PCM_DPORT2_CH4_EN */

/**@} end of group AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_4 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_5 AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_5
 * @brief    Dataport 1 Slot Mapping Registers Channel 5
 * @{
 */

#define MXC_F_PCM_DPORT2_SLOT_MAP_CH5_POS 0 /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH5 Position */
#define MXC_F_PCM_DPORT2_SLOT_MAP_CH5 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT2_SLOT_MAP_CH5_POS)) /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH5 */

#define MXC_F_PCM_DPORT2_CH5_EN_POS 7 /**< MXC_F_PCM_DPORT2_CH5_EN Position */
#define MXC_F_PCM_DPORT2_CH5_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT2_CH5_EN_POS)) /**< MXC_F_PCM_DPORT2_CH5_EN */

/**@} end of group AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_5 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_6 AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_6
 * @brief    Dataport 1 Slot Mapping Registers Channel 6
 * @{
 */

#define MXC_F_PCM_DPORT2_SLOT_MAP_CH6_POS 0 /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH6 Position */
#define MXC_F_PCM_DPORT2_SLOT_MAP_CH6 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT2_SLOT_MAP_CH6_POS)) /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH6 */

#define MXC_F_PCM_DPORT2_CH6_EN_POS 7 /**< MXC_F_PCM_DPORT2_CH6_EN Position */
#define MXC_F_PCM_DPORT2_CH6_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT2_CH6_EN_POS)) /**< MXC_F_PCM_DPORT2_CH6_EN */

/**@} end of group AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_6 */

/**
 * @ingroup  audio_registers
 * @defgroup AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_7 AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_7
 * @brief    Dataport 1 Slot Mapping Registers Channel 7
 * @{
 */

#define MXC_F_PCM_DPORT2_SLOT_MAP_CH7_POS 0 /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH7 Position */
#define MXC_F_PCM_DPORT2_SLOT_MAP_CH7 \
    ((uint32_t)(0x000UL << MXC_F_PCM_DPORT2_SLOT_MAP_CH7_POS)) /**< MXC_F_PCM_DPORT2_SLOT_MAP_CH7 */

#define MXC_F_PCM_DPORT2_CH7_EN_POS 7 /**< MXC_F_PCM_DPORT2_CH7_EN Position */
#define MXC_F_PCM_DPORT2_CH7_EN \
    ((uint32_t)(0x01UL << MXC_F_PCM_DPORT2_CH7_EN_POS)) /**< MXC_F_PCM_DPORT2_CH7_EN */

/**@} end of group AUDIO_PCM_DATAPORT_2_SLOT_MAPPING_CHANNEL_7 */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_PERIPHDRIVERS_SOURCE_AUDIO_REGS_H_
